       IDENTIFICATION DIVISION.
       PROGRAM-ID. Lesson10.
       AUTHOR. WILLIAM-KEISLOHN.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CUSTOMERFILE ASSIGN TO "Customer.dat"
           ORGANIZATION IS LINE SEQUENTIAL
           ACCESS IS SEQUENTIAL.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       DATA DIVISION.
       FILE SECTION.
       FD CUSTOMERFILE.
       01 CUSTOMERDATA.
           02 IDNUM PIC 9(5).
           02 CUSTNAM.
               03 FIRSTNAME PIC X(15).
               03 LASTNAME PIC X(15).
       WORKING-STORAGE SECTION.
       01 WS-CUSTOMERDATA.
           02 WS-IDNUM PIC 9(5).
           02 WS-CUSTNAM.
               03 WS-FIRSTNAME PIC X(15).
               03 WS-LASTNAME PIC X(15).
       PROCEDURE DIVISION.
       OPEN OUTPUT CUSTOMERFILE.
       MOVE 00001 TO IDNUM.
       MOVE 'WILLIAM' TO FIRSTNAME.
       MOVE 'KEILSOHN' TO LASTNAME.
       WRITE CUSTOMERDATA
       END-WRITE.
       CLOSE CUSTOMERFILE.

       STOP RUN.
