       IDENTIFICATION DIVISION.
       PROGRAM-ID. Lesson12.
       AUTHOR. WILLIAM-KEISLOHN.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CUSTOMERFILE ASSIGN TO "Customer.dat"
           ORGANIZATION IS LINE SEQUENTIAL
           ACCESS IS SEQUENTIAL.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       DATA DIVISION.
       FILE SECTION.
       FD CUSTOMERFILE.
       01 CUSTOMERDATA.
           02 IDNUM PIC 9(5).
           02 CUSTNAM.
               03 FIRSTNAME PIC X(15).
               03 LASTNAME PIC X(15).
       WORKING-STORAGE SECTION.
       01 WS-CUSTOMERDATA.
           02 WS-IDNUM PIC 9(5).
           02 WS-CUSTNAM.
               03 WS-FIRSTNAME PIC X(15).
               03 WS-LASTNAME PIC X(15).
       01 WS-EOF PIC A(1).
       
       PROCEDURE DIVISION.
       OPEN INPUT CUSTOMERFILE.
           PERFORM UNTIL WS-EOF = 'Y'
           READ CUSTOMERFILE INTO WS-CUSTOMERDATA
           AT END MOVE 'Y' TO WS-EOF
           NOT AT END DISPLAY WS-CUSTOMERDATA
           END-READ
           END-PERFORM.
       CLOSE CUSTOMERFILE.

       STOP RUN.
