       IDENTIFICATION DIVISION.
       PROGRAM-ID. LESSON-4.
       AUTHOR. WILLIAM-KEISLOHN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 CNT PIC 9(1) VALUE 3.

       PROCEDURE DIVISION.
       SUBONE.
           DISPLAY "IN PARAGRAPH 1"
           PERFORM SUBTWO
           DISPLAY "RETURN TO PARAGRAPH 1"
           PERFORM UNTIL CNT = 0
               PERFORM SUBFOUR
               SUBTRACT 1 FROM CNT
           END-PERFORM.
           PERFORM SUBFOUR 2 TIMES.
           STOP RUN.

       SUBTHREE.
           DISPLAY "IN PARAGRAPH 3".

       SUBTWO.
           DISPLAY "IN PARAGRAPH 2"
           PERFORM SUBTHREE
           DISPLAY "RETURN TO PARAGRAPH 2".

       SUBFOUR.
           DISPLAY "REPEAT".

       STOP RUN.
