       IDENTIFICATION DIVISION.
       PROGRAM-ID. Lesson8.
       AUTHOR. WILLIAM-KEISLOHN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 PRICE PIC 9(4)V99.
       01 TAXRATE PIC V999 VALUE 0.075.
       01 FULLPRICE PIC 9(4)V99.
       
       PROCEDURE DIVISION.
       DISPLAY "ENTER A PRICE: " WITH NO ADVANCING
       ACCEPT PRICE.
       COMPUTE FULLPRICE ROUNDED = PRICE + (PRICE * TAXRATE).
       DISPLAY "PRICE AFTER TAX: " FULLPRICE.

       STOP RUN.
       