       IDENTIFICATION DIVISION.
       PROGRAM-ID. Lesson10.
       AUTHOR. WILLIAM-KEISLOHN.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CUSTOMERFILE ASSIGN TO "Customer.dat"
           ORGANIZATION IS LINE SEQUENTIAL
           ACCESS IS SEQUENTIAL.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       DATA DIVISION.
       FILE SECTION.
       FD CUSTOMERFILE.
       01 CUSTOMERDATA.
           02 IDNUM PIC 9(5).
           02 CUSTNAM.
               03 FIRSTNAME PIC X(15).
               03 LASTNAME PIC X(15).
       WORKING-STORAGE SECTION.
       01 WS-CUSTOMERDATA.
           02 WS-IDNUM PIC 9(5).
           02 WS-CUSTNAM.
               03 WS-FIRSTNAME PIC X(15).
               03 WS-LASTNAME PIC X(15).
       PROCEDURE DIVISION.
       OPEN EXTEND CUSTOMERFILE. *> File must already have data.
           DISPLAY "ENTER CUSTOMER ID: " WITH NO ADVANCING
           ACCEPT IDNUM.
           DISPLAY "ENTER CUSTOMER FIRST NAME: " WITH NO ADVANCING
           ACCEPT FIRSTNAME.
           DISPLAY "ENTER CUSTOMER LAST NAME: " WITH NO ADVANCING
           ACCEPT LASTNAME.
           WRITE CUSTOMERDATA
           END-WRITE.
       CLOSE CUSTOMERFILE.

       STOP RUN.
