       IDENTIFICATION DIVISION.
       PROGRAM-ID. Lesson7.
       AUTHOR. WILLIAM-KEISLOHN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 STARTNUM PIC 9(8)V99 VALUE 00001123.55.
       01 NOZERO PIC ZZZZZZ9.99.
       01 NOZEROPLUSC PIC ZZ,ZZZ,ZZ9.99.
       01 DOLLAR PIC $$,$$$,$$9.99.
       01 BDAY PIC 9(8) VALUE 12211974.
       01 ADATE PIC 99/99/9999.
       PROCEDURE DIVISION.
       MOVE STARTNUM TO NOZERO.
       DISPLAY NOZERO.
       MOVE STARTNUM TO NOZEROPLUSC.
       DISPLAY NOZEROPLUSC.
       MOVE STARTNUM TO DOLLAR.
       DISPLAY DOLLAR.
       MOVE BDAY TO ADATE.
       DISPLAY ADATE.

       STOP RUN. 
       