       IDENTIFICATION DIVISION.
       PROGRAM-ID. Lesson6.
       AUTHOR. WILLIAM-KEISLOHN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 IND PIC 9(1) VALUE 0.

       PROCEDURE DIVISION.
       
       PERFORM OUTPUTDATA WITH TEST AFTER UNTIL IND > 5
           GO TO FORLOOP. 

       OUTPUTDATA.
           DISPLAY IND.
           ADD 1 TO IND.

       FORLOOP.
           PERFORM OUTPUTDATA2 VARYING IND FROM 1 BY 1 UNTIL IND = 5.
           STOP RUN.

       OUTPUTDATA2.
           DISPLAY IND.

       STOP RUN. 
       