       IDENTIFICATION DIVISION.
       PROGRAM-ID. Lesson52.
       AUTHOR. WILLIAM-KEISLOHN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       DATA DIVISION.
       LINKAGE SECTION.
           01 LNUM1 PIC 9 VALUE 5.
           01 LNUM2 PIC 9 VALUE 4.
           01 LSUM1 PIC 99.
       PROCEDURE DIVISION USING LNUM1, LNUM2, LSUM1.
           COMPUTE LSUM1 = LNUM1 + LNUM2.

       EXIT PROGRAM.
