       IDENTIFICATION DIVISION.
       PROGRAM-ID. Lesson5.
       AUTHOR. WILLIAM-KEISLOHN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 NUM1 PIC 9 VALUE 5.
           01 NUM2 PIC 9 VALUE 4.
           01 SUM1 PIC 99.

       PROCEDURE DIVISION.
       CALL 'Lesson52' USING NUM1, NUM2, SUM1.
       DISPLAY NUM1 " + " NUM2 " = " SUM1

       STOP RUN. 
       